Тест/Тест/src/Documents/СписаниеТМЦВорктрак/СписаниеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТМЦВорктрак</name>
  <basedOn>Document.ПоступлениеТМЦВорктрак</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписания</name>
    <type>
      <types>EnumRef.ВидыСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВРасход</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВПродажу</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеВЗаказНаряд</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНаСотрудника</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеНаОтдел</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.ИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСписания</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВРасход</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Доставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/ДвижениеТМЦВорктрак/ДвижениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеТМЦВорктрак</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/AccumulationRegisters/БюджетТМЦ/БюджетТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БюджетТМЦ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ТМЦВорктрак</types>
    </type>
  </attributes>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категрия</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Расход</name>
    <type>
      <types>DocumentRef.Расходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРасхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокРег</name>
    <type>
      <types>String</types>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПеремещениеТМЦВорктрак</types>
      <types>DocumentRef.СписаниеТМЦВорктрак</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.ИнвентарныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ПоступлениеТМЦВорктрак/ПоступлениеТМЦВорктрак.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТМЦВорктрак</name>
  <basedOn>Document.ЗаявкаНаРасход</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеТМЦВорктрак</registerRecords>
  <registerRecords>AccumulationRegister.БюджетТМЦ</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХраненияТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУПД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>DocumentRef.Расходы</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыРасхода_3</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениенаРасход</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасход</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТМЦ</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХраненияТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТМЦПоНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипУчетаТМЦ</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/ИнвентарныеНомера/ИнвентарныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвентарныеНомера</name>
  <owners>Catalog.СкладСнабжение</owners>
  <owners>Catalog.ТМЦВорктрак</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПоступлениеТМЦ</types>
      <types>DocumentRef.ПоступлениеТМЦСкладСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвентарногоНомераТМЦ</name>
    <type>
      <types>EnumRef.СтатусыИнвентарныхНомеровТМЦ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопКомментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Documents/СписаниеТМЦВорктрак/ObjectModule.bsl
#Область ОбработчикиСобытийФормы

Процедура ОбработкаПроведения(Отказ, Режим)
	
	///+ГомзМА 07.04.2023
	Движения.ДвижениеТМЦВорктрак.Записывать = Истина;
	
	// регистр ДвижениеТМЦВорктрак Расход
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение 							= Движения.ДвижениеТМЦВорктрак.Добавить();
		Движение.ВидДвижения 			= ВидДвиженияНакопления.Расход;
		Движение.Период 	 				= Дата;
		Движение.ТМЦ 		 				= ТекСтрокаСписокТМЦ.ТМЦ;
		Движение.МестоХранения 		= ТекСтрокаСписокТМЦ.СкладСписания;
		Движение.ИнвентарныйНомер 	= ТекСтрокаСписокТМЦ.ИнвентарныйНомер;
		Движение.Количество 			= ТекСтрокаСписокТМЦ.Количество;
		Движение.Цена 					= ТекСтрокаСписокТМЦ.Цена;
	КонецЦикла;
	///-ГомзМА 07.04.2023
	
	///+ГомзМА 05.04.2023
	Движения.Записать();
	
	Отказ = РегистрыНакопления.ДвижениеТМЦВорктрак.ЕстьОтрицательныеОстатки(Ссылка, Дата, ТекСтрокаСписокТМЦ.СкладСписания); 
	///-ГомзМА 05.04.2023
	
	/// +++ Запись в регистр БюджетТМЦ (МазинЕС)
		
		
		// +++ Очищаем регистр от записей сделаных конкретным документом поступления
//			НаборЗаписей = РегистрыСведений.БюджетТМЦ.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.ДокРег.Установить(Ссылка); 
//			НаборЗаписей.Очистить();
//			НаборЗаписей.Записать(); 
		// --- Очищаем регистр от записей сделаных конкретным документом поступления	
		
		
		
		
		Для каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл	
			
			Структура = НайтиРасходТМЦ(ТекСтрокаСписокТМЦ.ИнвентарныйНомер);
			
				Если Структура.Расход <> Документы.Расходы.ПустаяСсылка() Тогда  
					
					НоваяЗапись 							= РегистрыСведений.БюджетТМЦ.СоздатьМенеджерЗаписи(); 
					
					
					НоваяЗапись.ТМЦ						= ТекСтрокаСписокТМЦ.ТМЦ;
					НоваяЗапись.Расход 					= Структура.Расход;
					НоваяЗапись.ДокРег					= Ссылка;
							
					НоваяЗапись.ДатаРасхода			= Структура.ДатаРасхода;
					НоваяЗапись.Период					= Дата;
					НоваяЗапись.ИнвентарныйНомер 	= ТекСтрокаСписокТМЦ.ИнвентарныйНомер;
					НоваяЗапись.Количество				= ТекСтрокаСписокТМЦ.Количество;
					НоваяЗапись.Цена						= ТекСтрокаСписокТМЦ.Цена;
					НоваяЗапись.Сумма					= ТекСтрокаСписокТМЦ.Количество * ТекСтрокаСписокТМЦ.Цена; 
					НоваяЗапись.Коментарий				= Комментарий; 
					
					
					НоваяЗапись.Филиал 					= Филиал;
					НоваяЗапись.Отдел 					= Отдел;
					НоваяЗапись.ВидыРасхода_3 		= ВидыРасхода_3;
					НоваяЗапись.Категрия 				= Категория;
					НоваяЗапись.Статья 					= Статья;		
					
					НоваяЗапись.Записать();
				
				КонецЕсли; 
		КонецЦикла;

/// --- Запись в регистр БюджетТМЦ (МазинЕС)
	
КонецПроцедуры

Функция НайтиРасходТМЦ(ИнвентарныйНомер)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БюджетТМЦ.ИнвентарныйНомер,
		|	БюджетТМЦ.ДатаРасхода,
		|	БюджетТМЦ.Расход,
		|	БюджетТМЦ.Коментарий
		|ИЗ
		|	РегистрСведений.БюджетТМЦ КАК БюджетТМЦ
		|ГДЕ
		|	БюджетТМЦ.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура= Новый Структура();  
	
	Структура.Вставить("Расход",Документы.Расходы.ПустаяСсылка());
	Структура.Вставить("ДатаРасхода",'20010101'); // Произвольная дата
	Структура.Вставить("Коментарий","");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура.Вставить("Расход",ВыборкаДетальныеЗаписи.Расход );
		Структура.Вставить("ДатаРасхода",ВыборкаДетальныеЗаписи.ДатаРасхода);
		Структура.Вставить("Коментарий",ВыборкаДетальныеЗаписи.Коментарий);
	КонецЦикла;
			
	Возврат Структура;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	СкладСписания = Справочники.Стеллаж.НайтиПоКоду("000000871");
		
	///+ГомзМА 21.06.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТМЦВорктрак") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Ссылка КАК Ссылка,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления";
		
		Запрос.УстановитьПараметр("ДокументПоступления", ДанныеЗаполнения.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			//Проверка на дубли в регистре накопления ДвижениеТМЦВорктрак
			Количество = РаботаСДокументамиТМЦВызовСервера.ПолучитьСуммуКоличестваЗадубленныхСтрок(РезультатЗапроса.ДокументПоступления, РезультатЗапроса.Ссылка);
			
			НоваяСтрока = СписокТМЦ.Добавить();
			НоваяСтрока.ИнвентарныйНомер 	= РезультатЗапроса.Ссылка;
			НоваяСтрока.ТМЦ 				= РезультатЗапроса.Владелец;
			НоваяСтрока.СерийныйНомер 		= РезультатЗапроса.СерийныйНомер;
			ДокументПоступленияТЧ = ПолучитьТабличнуюЧастьДокументаПоступление(РезультатЗапроса.Владелец, РезультатЗапроса.ДокументПоступления);
			
			Если ДокументПоступленияТЧ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
				НоваяСтрока.Количество 			= 1;
				НоваяСтрока.Сумма 				= ДокументПоступленияТЧ.Цена;
			Иначе
				Если Количество = 0 Тогда
					НоваяСтрока.Количество 		= ДокументПоступленияТЧ.Количество;
				Иначе
					НоваяСтрока.Количество 		= Количество;
				КонецЕсли;
				НоваяСтрока.Сумма 				= ДокументПоступленияТЧ.Сумма;
			КонецЕсли;
			
			НоваяСтрока.Цена 					= ДокументПоступленияТЧ.Цена;
			НоваяСтрока.СкладСписания 			= ДокументПоступленияТЧ.Склад;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 21.06.2023
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
	
	///+ГомзМА 27.04.2023
	//смена статуса Инвентарного номера ТМЦ при списании
	Для каждого СтрокаСписокТМЦ Из СписокТМЦ Цикл
		СправочникОбъект = СтрокаСписокТМЦ.ИнвентарныйНомер.ПолучитьОбъект();
		СправочникОбъект.СтатусИнвентарногоНомераТМЦ = Перечисления.СтатусыИнвентарныхНомеровТМЦ.Списан;
		СправочникОбъект.Записать();
	КонецЦикла;
	///-ГомзМА 27.04.2023
	
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТекущееМестоХраненияТМЦ(ТМЦ, ИнвентарныйНомер)

	///+ГомзМА 27.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.МестоХранения КАК МестоХранения
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки(&ДатаОстатков, ) КАК ДвижениеТМЦВорктракОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток > 0
		|	И ДвижениеТМЦВорктракОстатки.ТМЦ = &ТМЦ
		|	И ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("ДатаОстатков", 		ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТМЦ", 				ТМЦ);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", 	ИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.МестоХранения;
	///-ГомзМА 27.04.2023

КонецФункции // ПолучитьТекущееМестоХраненияТМЦ()

Процедура ПриЗаписи(Отказ)
	
	///+ГомзМА 16.05.2023
	Если ВидСписания = Перечисления.ВидыСписания.ВПродажу Тогда
		Если ЗначениеЗаполнено(СписаниеВПродажу) Тогда
			ЗаказНаряд = СписаниеВПродажу;
			ДокОбъект 	 = ЗаказНаряд.ПолучитьОбъект();
			Если Проведен Тогда
				//Перезапись строк ТЧ по документу списание
				РаботаСДокументамиТМЦВызовСервера.УдалитьСтрокиТабличнойЧасти(ДокОбъект, Ссылка);
				
				Для каждого СтрокаСписокТМЦ Из СписокТМЦ Цикл
					СтрокаТЧ 	 				= ДокОбъект.ТМЦ.Добавить();
					СтрокаТЧ.ТМЦ 				= СтрокаСписокТМЦ.ТМЦ;
					СтрокаТЧ.Количество 		= СтрокаСписокТМЦ.Количество;
					СтрокаТЧ.Цена 				= СтрокаСписокТМЦ.Цена;
					СтрокаТЧ.Сумма 				= СтрокаСписокТМЦ.Сумма;
					СтрокаТЧ.ИнвентарныйНомер 	= СтрокаСписокТМЦ.ИнвентарныйНомер;
					СтрокаТЧ.СерийныйНомер 		= СтрокаСписокТМЦ.СерийныйНомер;
					СтрокаТЧ.СкладСписания 		= СтрокаСписокТМЦ.СкладСписания;
					СтрокаТЧ.Основание 			= Ссылка;
				КонецЦикла;
				
				ДокОбъект.Записать();
			Иначе
				//Удаление строк ТЧ по документу списание при отмене проведения
				РаботаСДокументамиТМЦВызовСервера.УдалитьСтрокиТабличнойЧасти(ДокОбъект, Ссылка);
				ДокОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидСписания = Перечисления.ВидыСписания.ВЗаказНаряд Тогда
		Если ЗначениеЗаполнено(СписаниеВЗаказНаряд) Тогда
			ЗаказНаряд = СписаниеВЗаказНаряд;
			ДокОбъект 	 = ЗаказНаряд.ПолучитьОбъект();
			Если Проведен Тогда
				//Перезапись строк ТЧ по документу списание
				РаботаСДокументамиТМЦВызовСервера.УдалитьСтрокиТабличнойЧасти(ДокОбъект, Ссылка);
				
				Для каждого СтрокаСписокТМЦ Из СписокТМЦ Цикл
					СтрокаТЧ 	 				= ДокОбъект.ТМЦ.Добавить();
					СтрокаТЧ.ТМЦ 				= СтрокаСписокТМЦ.ТМЦ;
					СтрокаТЧ.Количество 		= СтрокаСписокТМЦ.Количество;
					СтрокаТЧ.Цена 				= СтрокаСписокТМЦ.Цена;
					СтрокаТЧ.Сумма 				= СтрокаСписокТМЦ.Сумма;
					СтрокаТЧ.ИнвентарныйНомер 	= СтрокаСписокТМЦ.ИнвентарныйНомер;
					СтрокаТЧ.СерийныйНомер 		= СтрокаСписокТМЦ.СерийныйНомер;
					СтрокаТЧ.СкладСписания 		= СтрокаСписокТМЦ.СкладСписания;
					СтрокаТЧ.Основание 			= Ссылка;
				КонецЦикла;
				
				ДокОбъект.Записать();
			Иначе
				//Удаление строк ТЧ по документу списание при отмене проведения
				РаботаСДокументамиТМЦВызовСервера.УдалитьСтрокиТабличнойЧасти(ДокОбъект, Ссылка);
				ДокОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
///-ГомзМА 16.05.2023
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличнуюЧастьДокументаПоступление(ТМЦ, ДокументПоступления)
	
	///+ГомзМА 21.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТМЦВорктракСписокТМЦ.Количество КАК Количество,
		|	ПоступлениеТМЦВорктракСписокТМЦ.ТипУчета КАК ТипУчета,
		|	ПоступлениеТМЦВорктракСписокТМЦ.Цена КАК Цена,
		|	ПоступлениеТМЦВорктракСписокТМЦ.Сумма КАК Сумма,
		|	ПоступлениеТМЦВорктракСписокТМЦ.Склад КАК Склад
		|ИЗ
		|	Документ.ПоступлениеТМЦВорктрак.СписокТМЦ КАК ПоступлениеТМЦВорктракСписокТМЦ
		|ГДЕ
		|	ПоступлениеТМЦВорктракСписокТМЦ.ТМЦ = &ТМЦ
		|	И ПоступлениеТМЦВорктракСписокТМЦ.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ТМЦ", 	ТМЦ);
	Запрос.УстановитьПараметр("Ссылка", ДокументПоступления);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса;
	///-ГомзМА 21.06.2023


КонецФункции // ПолучитьТабличнуюЧастьДокументаПоступление()

#КонецОбласти
